stas2z/SoftSerial_STM32/SoftSerial.cpp
#define _gpiowrite(a, b, c) (a)->regs->BSRR = (1U << (b)) << (16 * !(c))
#define _gpioread(a, b) ((a)->regs->IDR & (1U << (b)))
#define _readrx(a) _gpioread(rxport, rxbit)
#define _writepin(a, b)                                                        \
  (PIN_MAP[(a)].gpio_device)->regs->BSRR = (1U << PIN_MAP[(a)].gpio_bit)       \
                                           << (16 * !(b))
#define _writetx(c) txport->regs->BSRR = (1U << txbit) << (16 * !(c))

#elif defined(BHAL)

TIM_TypeDef *TIMS(uint8_t num) {
  switch (num) {
  case 1:
  default:
    return TIM1;
    break;
#ifdef TIM2
  case 2:
    return TIM2;
    break;
#endif
#ifdef TIM3
  case 3:
    return TIM3;
    break;
#endif
#ifdef TIM4
  case 4:
    return TIM4;
    break;
#endif
  }
}

#if 1
#define TIM_GET_COMPARE(__HANDLE__, __CHANNEL__)                               \
  (*(__IO uint32_t *)(&((__HANDLE__)->CCR1) + ((__CHANNEL__))))
#define TIM_SET_COMPARE(__HANDLE__, __CHANNEL__, __COMPARE__)                  \
  (*(__IO uint32_t *)(&((__HANDLE__)->CCR1) + ((__CHANNEL__))) = (__COMPARE__))
#define T_GCOMP(a) TIM_GET_COMPARE(timerSerialDEV, (a)-1)
#define T_SCOMP(a, b) TIM_SET_COMPARE(timerSerialDEV, (a)-1, (b))
#define T_GCNT(a) ((int16_t)timerSerialDEV->CNT)
#define T_SCNT(a) timerSerialDEV->CNT = (a)
#else
#define T_GCOMP timerSerial.getCaptureCompare
#define T_SCOMP timerSerial.setCaptureCompare
#define T_GCNT timerSerial.getCount
#define T_SCNT timerSerial.setCount
#endif

#define T_RFR(a) SET_BIT(timerSerialDEV->EGR, 0U)

#define _gpiowrite(a, b, c) (a)->BSRR = (1U << (b)) << (16 * !(c))
#define _gpioread(a, b) ((a)->IDR & (1U << (b)))
#define _readrx(a) _gpioread(rxport, rxbit)
#define _writepin(a, b)                                                        \
  _gpiowrite(get_GPIO_Port(STM_PORT(digitalPin[((a))])),                       \
             STM_PIN(digitalPin[((a))]), ((b)))
#define _writetx(c) _gpiowrite(txport, txbit, ((c)))
#elif defined(BGEN)
extern HardwareTimer *interruptTimers[18];
HardwareTimer *TIMS(uint8_t num) {
  switch (num) {
  case 1:
  default:
    return &Timer1;
    break;
#ifdef TIM2
  case 2:
    return &Timer2;
    break;
#endif
#ifdef TIM3
  case 3:
    return &Timer3;
    break;
#endif
#ifdef TIM4
  case 4:
    return &Timer4;
    break;
#endif
  }
  // return *interruptTimers[num];
}

TIM_TypeDef *TIMDEVS(uint8_t num) {
  switch (num) {
  case 1:
  default:
    return TIM1;
    break;
#ifdef TIM2
  case 2:
    return TIM2;
    break;
#endif
#ifdef TIM3
  case 3:
    return TIM3;
    break;
#endif
#ifdef TIM4
  case 4:
    return TIM4;
    break;
#endif
  }
}

#define T_GCOMP timerSerial.getCompare
#define T_SCOMP timerSerial.setCompare
#define T_GCNT timerSerial.getCount
#define T_SCNT timerSerial.setCount
#define T_RFR(a)

#define _gpiowrite(a, b, c) (a)->BSRR = (1U << (b)) << (16 * !(c))
#define _gpioread(a, b) ((a)->IDR & (1U << (b)))
#define _readrx(a) _gpioread(rxport, rxbit)
#define _writepin(a, b)                                                        \
  _gpiowrite(variant_pin_list[((a))].port,                                     \
             get_pin_id(variant_pin_list[((a))].pin_mask), ((b)))
#define _writetx(c) _gpiowrite(txport, txbit, ((c)))
#else
#error Core not supported
#endif

#define BIT_CHECK(a, b) ((a) & (1 << (b)))
/******************************************************************************
 * Timer Definitions
 * Change these if you wish to use different timer channels
 ******************************************************************************/

#define TIMER_MAX_COUNT 0xffff
#define _TX_CHANNEL 3
#define _RX_CHANNEL 4

/******************************************************************************
 * ISR Related to Statics
 * Don't modify anything here unless you know why and what
 ******************************************************************************/
SoftSerial *SoftSerial::interruptObject1;
SoftSerial *SoftSerial::interruptObject2;
SoftSerial *SoftSerial::interruptObject3;
SoftSerial *SoftSerial::interruptObject4;

voidFuncPtr SoftSerial::handleRXEdgeInterruptP[4] = {
    handleRXEdgeInterrupt1, handleRXEdgeInterrupt2, handleRXEdgeInterrupt3,
    handleRXEdgeInterrupt4};

htFuncPtr SoftSerial::handleRXBitInterruptP[4] = {
    handleRXBitInterrupt1, handleRXBitInterrupt2, handleRXBitInterrupt3,
    handleRXBitInterrupt4};

htFuncPtr SoftSerial::handleTXBitInterruptP[4] = {
    handleTXBitInterrupt1, handleTXBitInterrupt2, handleTXBitInterrupt3,
    handleTXBitInterrupt4};

#if defined(BHAL) || defined(BGEN)
#define TIMER_CH1 1 // TIM_CHANNEL_1
#define TIMER_CH2 2 // TIM_CHANNEL_2
#define TIMER_CH3 3 // TIM_CHANNEL_3
#define TIMER_CH4 4 // TIM_CHANNEL_4

#define TIMER_DIER_CC1IE_BIT TIM_DIER_CC1IE
#define TIMER_DIER_CC2IE_BIT TIM_DIER_CC2IE
#define TIMER_DIER_CC3IE_BIT TIM_DIER_CC3IE
#define TIMER_DIER_CC4IE_BIT TIM_DIER_CC4IE

#define TIMER_SR_CC1IF_BIT TIM_SR_CC1IF
#define TIMER_SR_CC2IF_BIT TIM_SR_CC2IF
#define TIMER_SR_CC3IF_BIT TIM_SR_CC3IF
#define TIMER_SR_CC4IF_BIT TIM_SR_CC4IF
#endif

#ifdef BMAP
static __always_inline uint32_t __RBIT(uint32_t value) {
  uint32_t result;
  asm volatile("rbit %0, %1" : "=r"(result) : "r"(value));
  return result;
}

#define POSITION_VAL(a) __builtin_clz(__RBIT((a)))
#endif

#if 0
static
  __always_inline
  uint8_t
get_pin_id (uint16_t pin)
{
  uint8_t
    id = 0;

  while (pin != 0x0001)
    {
      pin = pin >> 1;
      id++;
    }

  return id;
}
#else
#define get_pin_id POSITION_VAL
#endif

void SoftSerial::print_counters(Stream *S) {
  S->println("[" + String(millis()) + "] rxbit=" + String(rxbitc) +
             ", rxedge=" + String(rxedgec) + ", txbit=" + String(txbitc));
}

__always_inline void SoftSerial::init_timer_values(uint8_t TX_CHANNEL,
                                                   uint8_t RX_CHANNEL) {
  // reset counters
  rxbitc = rxedgec = txbitc = 0;
  s_dbg[0] = '\0';

  // Assign pointer to the hardware registers
#ifdef BHAL
  timerSerialDEV = TIMS(rxtxTimer);
#elif defined(BGEN)
  timerSerialDEV = TIMDEVS(rxtxTimer);
#else
  timerSerialDEV = timerSerial.c_dev();
#endif

  _rx_channel = RX_CHANNEL;
  _tx_channel = TX_CHANNEL;
  if (_rx_channel == _tx_channel) {
    _rx_channel = _RX_CHANNEL;
    _tx_channel = _TX_CHANNEL;
  }
  switch (_rx_channel) {
  case 1:
    RX_TIMER_CHANNEL = TIMER_CH1;
    RX_TIMER_MASK = TIMER_DIER_CC1IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC1IF_BIT;
    break;
  case 2:
    RX_TIMER_CHANNEL = TIMER_CH2;
    RX_TIMER_MASK = TIMER_DIER_CC2IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC2IF_BIT;
    break;
  case 3:
    RX_TIMER_CHANNEL = TIMER_CH3;
    RX_TIMER_MASK = TIMER_DIER_CC3IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC3IF_BIT;
    break;
  case 4:
  default:
    RX_TIMER_CHANNEL = TIMER_CH4;
    RX_TIMER_MASK = TIMER_DIER_CC4IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC4IF_BIT;
    break;
  }
  switch (_tx_channel) {
  case 1:
    TX_TIMER_CHANNEL = TIMER_CH1;
    TX_TIMER_MASK = TIMER_DIER_CC1IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC1IF_BIT;
    break;
  case 2:
    TX_TIMER_CHANNEL = TIMER_CH2;
    TX_TIMER_MASK = TIMER_DIER_CC2IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC2IF_BIT;
    break;
  default:
  case 3:
    TX_TIMER_CHANNEL = TIMER_CH3;
    TX_TIMER_MASK = TIMER_DIER_CC3IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC3IF_BIT;
    break;
  case 4:
    TX_TIMER_CHANNEL = TIMER_CH4;
    TX_TIMER_MASK = TIMER_DIER_CC4IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC4IF_BIT;
    break;
  }

  // Translate transmit pin number to external interrupt number
#if defined(BMAP)
  txport = PIN_MAP[transmitPin].gpio_device;
  txbit = PIN_MAP[transmitPin].gpio_bit;
  rxport = PIN_MAP[receivePin].gpio_device;
  rxbit = PIN_MAP[receivePin].gpio_bit;
  gpioBit = (exti_num)(txbit);
#elif defined(BHAL)
  txport = get_GPIO_Port(STM_PORT(digitalPin[transmitPin]));
  txbit = STM_PIN(digitalPin[transmitPin]);
  rxport = get_GPIO_Port(STM_PORT(digitalPin[receivePin]));
  rxbit = STM_PIN(digitalPin[receivePin]);
  gpioBit = get_pin_id(STM_GPIO_PIN(digitalPinToPinName(transmitPin)));
#else
  txport = variant_pin_list[transmitPin].port;
  txbit = get_pin_id(variant_pin_list[transmitPin].pin_mask);
  rxport = variant_pin_list[receivePin].port;
  rxbit = get_pin_id(variant_pin_list[receivePin].pin_mask);
  gpioBit = get_pin_id(txbit);
#endif
}

